package view;

import java.util.List;

/**
  * 保有銘柄残高一覧を表示するview
  */
public class ExportBondListView {
  /**
    * 保有銘柄残高一覧を表示するメソッド
    * @param bondList フォーマットされた保有銘柄の一覧リスト
    */
  public void showBondList(List<String> bondList) {
    System.out.println("+-----------------------------------------------------------------------------------------------------------------------+");
    System.out.printf("|%-7s|%-16s|%-5s|%-6s|%-5s|%-4s|%-13s|%-13s|%-8s|\n",
              "銘柄コード", "銘柄名", "償還年月日", "利率", "クーポン回数", "保有数量", "簿価", "時価", "評価損益");
    System.out.println("+-----------------------------------------------------------------------------------------------------------------------+");
    for(String bond : bondList) {
      System.out.println(bond);
    }
    System.out.println("+-----------------------------------------------------------------------------------------------------------------------+");
  }
}
